src/XRoadFolkRaw.Lib/Resources/Login.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:id="http://x-road.eu/xsd/identifiers"
                  xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
                  xmlns:prod="http://us-folk-v2.x-road.eu/producer">
  <soapenv:Header>
    <xrd:protocolVersion>4.0</xrd:protocolVersion>
    <xrd:id></xrd:id>
    <xrd:client id:objectType="SUBSYSTEM">
      <id:xRoadInstance></id:xRoadInstance>
      <id:memberClass></id:memberClass>
      <id:memberCode></id:memberCode>
      <id:subsystemCode></id:subsystemCode>
    </xrd:client>
    <xrd:service id:objectType="SERVICE">
      <id:xRoadInstance></id:xRoadInstance>
      <id:memberClass></id:memberClass>
      <id:memberCode></id:memberCode>
      <id:subsystemCode></id:subsystemCode>
      <id:serviceCode>Login</id:serviceCode>
      <id:serviceVersion>v1</id:serviceVersion>
    </xrd:service>
  </soapenv:Header>
  <soapenv:Body>
    <prod:Login>
      <request>
        <username></username>
        <password></password>
      </request>
    </prod:Login>
  </soapenv:Body>
</soapenv:Envelope>
